       IDENTIFICATION DIVISION.
       PROGRAM-ID. learning1.
      ********************************************************
      *    Printing a Hello Luan
      * *******************************************************
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
           DISPLAY 'HELLO LUAN'.
           STOP RUN.
