       01 CALENDARIO.
           02 WRK-ANO PIC X(04) VALUE SPACES.
           02 WRK-MES PIC X(02) VALUE SPACES.
           02 WRK-DIA PIC X(02) VALUE SPACES.
